backend/app/controllers/playlists_controller.rb

    def index
        playlists = Playlist.all
---
SELECT "playlists".* FROM "playlists"

    def create
        selectedNumber = Playlist.all.last.id
        playlist = Playlist.create(name: "My Playlist ##{selectedNumber}", image: "https://i.pinimg.com/originals/7e/4f/89/7e4f892475aca7242883ceaf8aa89cc9.jpg", user: User.all.find_by(id: playlist_params[:user_id]))
---
SELECT "playlists".* FROM "playlists" ORDER BY "playlists"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "playlists" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "My Playlist #2"], ["user_id", 1], ["created_at", "2021-04-06 08:12:04.037726"], ["updated_at", "2021-04-06 08:12:04.037726"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

      def show
        playlist = Playlist.find(params[:id])
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
        playlist = Playlist.find_by(id: params[:id])
        playlist.name = playlist_params[:name]
        playlist.image = playlist_params[:image]
        playlist.save
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "playlists" SET "image" = ?, "updated_at" = ? WHERE "playlists"."id" = ?  [["image", "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQcH-MLH4M6jxXvKdVrLPsbJrjwjzYoa7738A&usqp=CAU"], ["updated_at", "2021-04-07 10:01:55.715847"], ["id", 2]]