backend/app/controllers/playlist_songs_controller.rb

    def index
        playlistsongs = PlaylistSong.all
---
SELECT "playlist_songs".* FROM "playlist_songs"