backend/app/controllers/songs_controller.rb

    def create
        song = Song.new(name: song_params[:name], uri: song_params[:uri], duration_ms: song_params[:duration_ms], artists: song_params[:artists], album: song_params[:album].to_h)
        if song_params[:second_playlist_id]
          song.playlists << Playlist.all.find_by(id: song_params[:second_playlist_id])
        end
        song.playlists << Playlist.all.find_by(id: song_params[:playlist_id])
        song.save
---
INSERT INTO "songs" ("name", "uri", "duration_ms", "artist", "album", "album_artwork", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "songs" ("name", "uri", "duration_ms", "artists", "album", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

      def update
        song = Song.find_by(id: params[:id])
        if song_params[:playlist_id]
        playlist = Playlist.find_by(id: song_params[:playlist_id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

      def destroy
        song = Song.find_by(id: params[:id])
        song.destroy
        songs = Song.all
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 14]]
SELECT "songs".* FROM "songs"