backend/app/controllers/users_controller.rb

    def create
        user = User.create(display_name: user_params[:display_name], spotifyid: user_params[:spotifyid])
        Playlist.create(name: "User Library", image: "https://i.pinimg.com/originals/7e/4f/89/7e4f892475aca7242883ceaf8aa89cc9.jpg", user: user)
---
INSERT INTO "users" ("display_name", "spotifyid", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["display_name", "thehopegipson"], ["spotifyid", "thehopegipson"], ["created_at", "2021-04-05 21:47:51.672093"], ["updated_at", "2021-04-05 21:47:51.672093"]]
INSERT INTO "playlists" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "User Library"], ["user_id", 1], ["created_at", "2021-04-05 21:47:51.706884"], ["updated_at", "2021-04-05 21:47:51.706884"]]

      def update
        user = User.find_by(id: params[:id])
        user.display_name = user_params[:display_name]
        user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "display_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["display_name", "whatever"], ["updated_at", "2021-04-06 04:25:39.428012"], ["id", 1]]